# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{name: 'Chicago' }, {name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
project_statuses = ProjectStatus.create([{name: "Активен"}, {name: "Не активен"}, {name: "Завершен"}])
equip_statuses = EquipStatus.create([{name: "В проекте"}, {name: "Занято"}, {name: "Не рабочее"}, {name: "Свободно"}]])

skills = Skill.create([{name: "Дизайнер"}, {name: "Программист"}, {name: "Фотограф"}, {name: "Коучер"}])
workposts = Workpost.create([{name: "Учашийся"}, {name: "Преподаватель"}, {name: "Директор"}, {name: "Зав. кафедрой"}])

universities = University.create([{name: "ТОГУ"}, {name: "Программист"}])
project_directions = ProjectDirection.create([{name: "Информационные технологии (IT)"},
                                             {name: "Современные материалы и технологии их создания"},
                                             {name: "Аппаратные комплексы"},
                                             {name: "Медицина/биотехнологии"},
                                             {name: "Фундаментальные открытия"},
                                             {name: "Приборы"}])

socnets = Socnet.create([{name: "ВКонтакте", url: "https://vk.com/"},
                        {name: "Facebook", url: "https://www.facebook.com/"},
                        {name: "Twitter", url: "http://twitter.com/"}])

universities = University.create([{name: "ТОГУ", faculties: [
                                     {name: "Инженерно-строительный (ИСФ)", specialties: [
                                         {name: "Землеустройство и кадастры"},
                                         {name: "Нефтегазовое дело"},
                                         {name: "Строительство"},
                                         {name: "Техносферная безопасность"}]
                                    },
                                     {name: "Социально-гуманитарный (СГФ)", specialties: [
                                         {name: "Журналистика"},
                                         {name: "Зарубежное регионоведение"},
                                         {name: "Лингвистика"},
                                         {name: "Социальная работа"},
                                         {name: "Сервис"},
                                         {name: "Туризм"},
                                         {name: "Гостиничное дело"}]
                                    },
                                     {name: "Транспортно-энергетический (ТЭФ)", specialties: [
                                         {name: "Энергетическое машиностроение"},
                                         {name: "Технологические машины и оборудование"},
                                         {name: "Наземные транспортно-технологические комплексы"},
                                         {name: "Технология транспортных процессов"},
                                         {name: "Эксплуатация транспортно-технологических машин и комплексов"}]
                                    },
                                     {name: "Автоматизации и информационных технологий (ФАИТ)", specialties: [
                                         {name: "Металлургия"},
                                         {name: "Технологические машины и оборудование"},
                                         {name: "Конструкторско-технологическое обеспечение машиностроительных производств"},
                                         {name: "Инфокоммуникационные технологии и системы связи"},
                                         {name: "Управление в технических системах"},
                                         {name: "Управление качеством"},
                                         {name: "Стандартизация и метрология"},
                                         {name: "Инноватика"},
                                         {name: "Информатика и вычислительная техника"},
                                         {name: "Технология художественной обработки материалов"},
                                         {name: "Техносферная безопасность"}]
                                    },
                                     {name: "Архитектуры и дизайна (ФАД)", specialties: [
                                         {name: "Декоративно-прикладное искусство и народные промыслы"},
                                         {name: "Архитектура"},
                                         {name: "Дизайн архитектурной среды"}]
                                    },
                                     {name: "Компьютерных и фундаментальных наук (ФКФН)", specialties: [
                                         {name: "Физика"},
                                         {name: "Программная инженерия"},
                                         {name: "Прикладная математика"}]
                                    },
                                     {name: "Природопользования и экологии (ФПЭ)", specialties: [
                                         {name: "Химическая технология"},
                                         {name: "Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии"},
                                         {name: "Технология лесозаготовительных и деревоперерабатывающих производств"},
                                         {name: "Ландшафтная архитектура"}]
                                    },
                                     {name: "Экономики и управления (ФЭУ)", specialties: [
                                         {name: "Экономика"},
                                         {name: "Менеджмент"},
                                         {name: "Государственное и муниципальное управление"},
                                         {name: "Бизнес-информатика"},
                                         {name: "Торговое дело"},
                                         {name: "Прикладная информатика"}]
                                    },
                                     {name: "Юридический (ЮФ)", specialties: [
                                         {name: "Юриспруденция"}]
                                    }]
                                },
                             {name: "ДВГУПС", faculties: [
                                  {name: "Тяги и подвижного состава"},
                                  {name: "Управления, автоматизации и телекоммуникации", specialties: [
                                      {name: "Информационные системы и технологии на транспорте"},
                                      {name: "Информационные системы и технологии"},
                                      {name: "Системы автоматизированного проектирования"},
                                      {name: "Информатика и вычислительная техника"},
                                      {name: "Инфокоммуникационные технологии в сервисе и услугах связи"},
                                      {name: "Многоканальные телекоммуникационные системы"}]
                                 },
                                  {name: "Экономики", specialties: [
                                      {name: "Экономика"},
                                      {name: "Менеджмент"}]
                                 },
                                  {name: "Транспортного строительства", specialties: [
                                      {name: "Наземные транспортно-технологические комплексы"},
                                      {name: "Подъемно-транспортные, строительные, дорожные средства и оборудование"},
                                      {name: "Технология транспортных процессов"}]
                                 },
                                  {name: "Воздушных сообщений", specialties: [
                                      {name: "Организация и управление перевозками на воздушном транспорте"}]
                                 },
                                  {name: "Электроэнергитический", specialties: [
                                      {name: "Электропривод и автоматика"},
                                      {name: "Электроснабжение"},
                                      {name: "Электроэнергетические системы и сети"},
                                      {name: "Релейная защита и автоматизация электроэнергетических систем"},
                                      {name: "Электроэнергетика и электротехника"}]
                                 },
                                  {name: "Социально-гуманитарный"},
                                  {name: "Естественно-научный"},
                                  {name: "Международного сотрудничества"}]},
                            ]);
